Revit 2026 API

# ComboBox Events

---

The ComboBox type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurrentChanged | Subscribe to this event to be notified when the current item of the ComboBox is changed. |
|  | DropDownClosed | Subscribe to this event to be notified when the drop-down of the ComboBox is closed. |
|  | DropDownOpened | Subscribe to this event to be notified when the drop-down of the ComboBox is opened. |

#### Reference

ComboBox Class

Autodesk.Revit.UI Namespace